/*
 * GCat's Gameboy Emulator
 * Copyright (c) 2012 James Perry
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 * 
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 */

#include <stdio.h>
#include <stdlib.h>
#include <string.h>

typedef struct screenState_s {
    unsigned char scanline;  /* 0 */
    unsigned char vdpMode;   /* 1 */
    unsigned char spritesOnLine; /* 2 */
    char pad1;

    unsigned int colours[4]; /* 4 */
    unsigned int bgPalette[4]; /* 20 */
    unsigned int sprPalette0[4]; /* 36 */
    unsigned int sprPalette1[4]; /* 52 */

    unsigned char *lineScrolls; /* 68 */
    unsigned int *screenBuffer; /* 72 */
    unsigned char *videoRAM;    /* 76 */
} screenState_t;

typedef struct soundState_s
{
    unsigned char *soundBuffer; /* 0 */

    /* general channel 1 stuff */
    unsigned int channel1Freq; /* 4 */
    unsigned int channel1Counter; /* 8 */
    unsigned int channel1Threshold; /* 12 */ /* for the duty cycle */
    unsigned int channel1Length; /* 16 */ /* length cycles remaining */

    /* sweep - Step will be added to Freq whenever Counter passes
     * Threshold */
    unsigned int channel1SweepCounter; /* 20 */
    unsigned int channel1SweepThreshold; /* 24 */
    unsigned int channel1SweepStep;    /* 28 */ 

    /* envelope - Step will be added to Level whenever Counter passes
     * Threshold */
    unsigned int channel1EnvCounter; /* 32 */
    unsigned int channel1EnvThreshold;    /* 36 */
    unsigned char channel1Level;     /* 40 */
    signed char channel1LevelStep;   /* 41 */
    short pad1;                      /* 42 */

    /* Channel 2 general */
    unsigned int channel2Freq;    /* 44 */
    unsigned int channel2Counter; /* 48 */
    unsigned int channel2Threshold; /* 52 */
    unsigned int channel2Length;    /* 56 */

    /* channel 2 envelope */
    unsigned int channel2EnvCounter; /* 60 */
    unsigned int channel2EnvThreshold; /* 64*/
    unsigned char channel2Level;     /* 68 */
    signed char channel2LevelStep;   /* 69 */
    short pad2;                      /* 70 */

    /* channel 3 general */
    unsigned int channel3Freq;     /* 72 */
    unsigned int channel3Counter;  /* 76 */
    unsigned int channel3Length;   /* 80 */
    unsigned char channel3Sample;  /* 84 */
    char pad3;
    short pad4;

    /* channel 4 general */
    unsigned int channel4Freq;     /* 88 */
    unsigned int channel4Counter;  /* 92 */
    unsigned int channel4Length;   /* 96 */
    unsigned int channel4LFSR;     /* 100 */

    /* channel 4 envelope */
    unsigned int channel4EnvCounter; /* 104 */
    unsigned int channel4EnvThreshold;  /* 108 */
    unsigned int channel4Level;         /* 112 */
    signed char channel4LevelStep;      /* 116 */
    char pad5;
    short pad6;

    unsigned int channel1Output;   /* 120 */
    unsigned int channel2Output;   /* 124 */
    unsigned int channel3Output;   /* 128 */
    unsigned int channel4Output;   /* 132 */
} soundState_t;

/*
 * This structure holds all the important things the assembly code
 * needs to access. Mostly CPU state but also some Gameboy state
 * too.
 */
typedef struct z80State_s {
    int tstates; /* 0 */

    unsigned char **readPages; /* 4 */
    unsigned char *mem; /* 8 */

    unsigned short af; /* 12 */
    unsigned short bc; /* 14 */
    unsigned short de; /* 16 */
    unsigned short hl; /* 18 */

    unsigned short sp; /* 20 */
    unsigned short pc; /* 22 */

    unsigned short ix; /* 24 */
    unsigned short iy; /* 26 */
  
    unsigned short afp; /* 28 */
    unsigned short bcp; /* 30 */
    unsigned short dep; /* 32 */
    unsigned short hlp; /* 34 */

    unsigned char i; /* 36 */
    unsigned char r; /* 37 */
    unsigned char iff1; /* 38 */
    unsigned char iff2; /* 39 */

    unsigned int *itable; /* 40 */
    soundState_t *soundState; /* 44 */
    unsigned char *vhAddTable; /* 48 */
    unsigned char *vhSubTable; /* 52 */

    unsigned int *cbitable; /* 56 */
    unsigned int dividerCounter; /* 60 */
    unsigned int timerCounter; /* 64 */
    unsigned int timerIncrement; /* 68 */

    unsigned char intPending; /* 72 */
    unsigned char imode; /* 73 */
    unsigned char regWritten; /* 74 */
    /* Should be (from bit 0): RLUDABSelStart, active low */
    unsigned char joypadData; /* 75 */

    unsigned char screenEnabled; /* 76 */
    unsigned char romSize;       /* 77 */ /* in pages */
    unsigned char serialLatency; /* 78 */
    unsigned char mbcType;  /* 79 */

    unsigned char *oamRAM; /* 80 */
    screenState_t *screenState; /* 84 */
    unsigned char *ioRAM; /* 88 */

    unsigned short debugWords[8]; /* 92 */

    unsigned char pagingRegs[4]; /* 108 */

    unsigned char ramSize;  /* 112 */ /* in pages */
} z80State_t;

/* The CPU state */
static z80State_t z80State;
static screenState_t screenState;
static soundState_t soundState;

static unsigned char *cartridgeROM;
static unsigned char *cartridgeRAM;
static unsigned char *internalRAM;
static unsigned char *videoRAM;

static unsigned char *pageTable[20];

static int cartridgeSize;

static unsigned char newJoypadState;

/* sprite table and registers */
static unsigned char ioRAM[512];
//static unsigned char *ioRAM;

//static int executing = 0;

extern unsigned int insn_table[256];
extern unsigned int cbinsn_table[256];

/*
 * Gameboy memory map:
 *
 * 0000-3FFF - first ROM bank (always #0)
 * 4000-7FFF - second ROM bank (switchable)
 * 8000-9FFF - 8K video RAM
 * A000-BFFF - switchable RAM (from cartridge?)
 * C000-FDFF - internal RAM
 * FE00-FEFF - sprite table
 * FF00-FFFF - I/O registers
 *
 * Paging:
 *  - For MBC1:
